// src/data/movies.js

export const movies = [
  {
    id: 1,
    poster: '/images/casablanca.jpg',
    title: 'Касабланка',
    desc: 'Незабутня романтична драма часів Другої світової війни в Марокко.',
    genre: 'Драма',
    time: '2025-06-01T19:30:00'
  },
  {
    id: 2,
    poster: '/images/godfather.jpg',
    title: 'Хрещений батько',
    desc: 'Епічна сага про родину впливового мафіозного клану.',
    genre: 'Кримінал',
    time: '2025-06-02T20:00:00'
  },
  {
    id: 3,
    poster: '/images/pulp-fiction.jpg',
    title: 'Кримінальне чтиво',
    desc: 'Нелінійна історія двох кілерів, їхні діалоги й пригоди в Лос-Анджелесі.',
    genre: 'Кримінал',
    time: '2025-06-03T18:00:00'
  },
  {
    id: 4,
    poster: '/images/nemo.jpg',
    title: 'У пошуках Немо',
    desc: 'Анімаційна пригода рибки, що шукає свого загубленого сина.',
    genre: 'Анімація',
    time: '2025-06-04T17:00:00'
  },
  {
    id: 5,
    poster: '/images/interstellar.jpg',
    title: 'Інтерстеллар',
    desc: 'Науково-фантастична подорож галактикою в пошуках нового дому для людства.',
    genre: 'Наукова фантастика',
    time: '2025-06-05T16:15:00'
  },
  {
    id: 6,
    poster: '/images/jurassic-world.jpg',
    title: 'Парк Юрського періоду',
    desc: 'Напружена пригода в тематичному парку з живими динозаврами.',
    genre: 'Пригоди',
    time: '2025-06-05T18:30:00'
  },
  {
    id: 7,
    poster: '/images/shawshank.jpg',
    title: 'Втеча з Шоушенка',
    desc: 'Незабутня історія дружби і надії в стінах в’язниці Шоушенк.',
    genre: 'Драма',
    time: '2025-06-06T19:45:00'
  },
  
  {
    id: 8,
    poster: '/images/parasite.jpg',
    title: 'Паразити',
    desc: 'Чорна комедійна драма про сім’ю, яка потрапляє у світ багатіїв Південної Кореї.',
    genre: 'Драма',
    time: '2025-06-08T18:30:00'
  },
  {
    id: 9,
    poster: '/images/dark-knight.jpg',
    title: 'Темний лицар',
    desc: 'Напружений супергеройський трилер, у якому Бетмен протистоїть Джокеру.',
    genre: 'Бойовик',
    time: '2025-06-09T19:00:00'
  }
];
